tf-controller plan output:

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.function_app.azurerm_linux_function_app.func_app["export001sales"] will be created
  + resource "azurerm_linux_function_app" "func_app" {
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "westeurope"
      + name                                           = "export001sales"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-sales-kpi-001"
      + service_plan_id                                = "/subscriptions/a7a278a9-cb30-4464-853f-1141c25a74f8/resourceGroups/rg-sales-kpi-001/providers/Microsoft.Web/serverFarms/rg-service-plan"
      + site_credential                                = (sensitive value)
      + storage_account_name                           = "linfuncrgst"
      + storage_uses_managed_identity                  = true
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)
        }
    }

  # module.storage.azurerm_role_assignment.storage_access["0"] must be replaced
-/+ resource "azurerm_role_assignment" "storage_access" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/a7a278a9-cb30-4464-853f-1141c25a74f8/resourceGroups/rg-sales-kpi-001/providers/Microsoft.Storage/storageAccounts/adlssaleskpi001/providers/Microsoft.Authorization/roleAssignments/6b45ba3c-ca7a-bd64-ef75-2a7e1306dc35" -> (known after apply)
      ~ name                             = "6b45ba3c-ca7a-bd64-ef75-2a7e1306dc35" -> (known after apply)
      ~ principal_id                     = "7d780cfe-1306-4ce8-8318-3c757bf3df6b" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a7a278a9-cb30-4464-853f-1141c25a74f8/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.storage.azurerm_role_assignment.storage_access["1"] must be replaced
-/+ resource "azurerm_role_assignment" "storage_access" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/a7a278a9-cb30-4464-853f-1141c25a74f8/resourceGroups/rg-sales-kpi-001/providers/Microsoft.Storage/storageAccounts/adlssaleskpi001/providers/Microsoft.Authorization/roleAssignments/0cc4952a-eb0a-6408-0c60-7607bd56f53c" -> (known after apply)
      ~ name                             = "0cc4952a-eb0a-6408-0c60-7607bd56f53c" -> (known after apply)
      ~ principal_id                     = "b2ff575d-ace9-4380-a6e9-b041b42d51b9" -> "7d780cfe-1306-4ce8-8318-3c757bf3df6b" # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a7a278a9-cb30-4464-853f-1141c25a74f8/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.storage.azurerm_role_assignment.storage_access["2"] will be created
  + resource "azurerm_role_assignment" "storage_access" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2ff575d-ace9-4380-a6e9-b041b42d51b9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/a7a278a9-cb30-4464-853f-1141c25a74f8/resourceGroups/rg-sales-kpi-001/providers/Microsoft.Storage/storageAccounts/adlssaleskpi001"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 2 to destroy.

```

To apply this plan, please **merge** this pull request.
